//
//  TODO.swift
//  Navigation
//
//  Created by Олеся on 10.04.2023.
//

import Foundation
//не сделана проверка на добавление дублей понравившихся постов, а она по логике должна быть. Здесь лучше бы использовать уникальный id для записей постов, как это обычно делают в базах данных, но это рекомендация, сами решайте.
//
//И еще: при переходе в профиль пропадает tab bar и нельзя посмотреть ни Feed ни Favorites.

<<<<<<< HEAD
//test
=======
//Test develop

>>>>>>> 20ad4bc8f4a8eacfdebef0bbe5699cd73a4e5926
